In [53]:
import numpy as np
import matplotlib.pyplot as plt
from sklearn.datasets import load_iris
import pandas as pd

In [54]:
iris=load_iris()
iris_df=pd.DataFrame(data=iris['data'],columns=iris['feature_names']) # type: ignore

In [55]:
iris_df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [56]:
iris_df.tail()

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

In [57]:
p1=pd.Series([0,np.nan,' ',None])
p1

0       0
1     NaN
2
3    None
dtype: object

In [58]:
p1.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [59]:
p1.dropna()

0    0
2
dtype: object

In [70]:
p2=pd.DataFrame([[1,np.nan,7],
                 [2,5,8],
                 [np.nan,6,9]])
p2

     0    1  2
0  1.0  NaN  7
1  2.0  5.0  8
2  NaN  6.0  9

In [73]:
p2[3]=np.nan
p2

     0    1  2   3
0  1.0  NaN  7 NaN
1  2.0  5.0  8 NaN
2  NaN  6.0  9 NaN

In [90]:
p2.dropna(axis='columns',thresh=2)# type: ignore

     0    1  2
0  1.0  NaN  7
1  2.0  5.0  8
2  NaN  6.0  9

In [101]:
p3 = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
p3

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [102]:
p3.fillna(2)

a    1.0
b    2.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [103]:
p3.fillna(method="ffill")

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [106]:
p3

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [104]:
p3.fillna(method="bfill")

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [107]:
p2

     0    1  2   3
0  1.0  NaN  7 NaN
1  2.0  5.0  8 NaN
2  NaN  6.0  9 NaN

In [108]:
p2.fillna(method='ffill',axis=1)

     0    1    2    3
0  1.0  1.0  7.0  7.0
1  2.0  5.0  8.0  8.0
2  NaN  6.0  9.0  9.0

In [113]:
p4=pd.DataFrame({'Letters':['A','B']*2+['B'],
                  'Numbers':[1,2,1,3,3]})
p4

  Letters  Numbers
0       A        1
1       B        2
2       A        1
3       B        3
4       B        3

In [114]:
p4.duplicated()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [116]:
p4.drop_duplicates()

  Letters  Numbers
0       A        1
1       B        2
3       B        3

In [129]:
p4.drop_duplicates(['Letters'])

  Letters  Numbers
0       A        1
1       B        2

In [131]:
# ------------------------------------------------------------------------------------------------------

In [138]:
iris_df.columns

Index(['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)',
       'petal width (cm)'],
      dtype='object')

In [139]:
iris_df.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000